dualJets3Mesh_kappaEpsilonTurbulenceOff_v2_pisoFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  outletWall
    {
        type            zeroGradient;
    }
    fineWalls
    {
        type            noSlip;
    }
    fineFrontAndBack
    {
        type            zeroGradient;
    }
    fineplugLeft
    {
        type            cyclicAMI;
    }
    fineplugRight
    {
        type            cyclicAMI;
    }
    inletOutletLeft
    {
        type            cyclicAMI;
    }
    inletLeft
    {
         type            fixedValue;
         value uniform (0 -60 140.0);
    }
    inletWallsLeft
    {
        type            noSlip;
    }
    inletFacesLeft
    {
        type            zeroGradient;
    }
    inletOutletRight
    {
        type            cyclicAMI;
    }
    inletRight
    {
         type            fixedValue;
         value uniform (0 60.0 140.0);
    }
    inletWallsRight
    {
        type            noSlip;
    }
    inletFacesRight
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
