dualJets3Mesh_kappaEpsilonTurbulenceOff_v2_pisoFoam/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outletWall
    {
        type            calculated;
        value           uniform 0;
    }
    fineWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    fineFrontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    fineplugLeft
    {
        type            cyclicAMI;
    }
    inletOutletLeft
    {
        type            cyclicAMI;
    }
    inletLeft
    {
        type            calculated;
        value           uniform 0;
    }
    inletWallsLeft
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inletFacesLeft
    {
        type            calculated;
        value           uniform 0;
    }
    fineplugRight
    {
        type            cyclicAMI;
    }
    inletOutletRight
    {
        type            cyclicAMI;
    }
    inletRight
    {
        type            calculated;
        value           uniform 0;
    }
    inletWallsRight
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inletFacesRight
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
