dualJets3Mesh_kappaEpsilonTurbulenceOff_v2_pisoFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          1e-06;
//        relTol          1e-06;
        smoother        GaussSeidel;
    }

   pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon|omega|R)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
//        relTol          0.1;
          relTol          1e-05;
//        relTol          1e-05;
    }
}

PISO
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

residualControl
    {
        p          
        {
            relTol          0;
            tolerance       1e-5;
        }
        U
        {
            relTol          0;
            tolerance       1e-5;
        }
        k
        {
            relTol          0;
            tolerance       1e-5;
        }
        epsilon
        {
            relTol          0;
            tolerance       1e-5;
        }
        omega
        {
            relTol          0;
            tolerance       1e-5;
        }
        R
        {
            relTol          0;
            tolerance       1e-5;
        }
    }

}

relaxationFactors
{
   fields
   {
          p      0.3;
   }


    equations
    {
        U               0.2; // 0.9 is more stable but 0.95 more convergent
        k               0.2;
         epsilon         0.2;
         omega           0.2;
         R               0.2;
//        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }


}


potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

// ************************************************************************* //

